array = ["Один", "Два"," Три"," Четыре"];
array.reverse();
//"Наоборот, Четыре, два, три, один

array = ["Один", "Два", "Три"," Четыре"];
array.concat(12);
//["Один", "Два"," Три"," Четыре", "12"]

array = ["Один", "Два"," Три"," Четыре"];
array.slice(1, -1);
//["Два"," Три"]

array = ["Один", "Два"," Три"," Четыре"];
array.splice(1,2, "2", "3");
//["Один", "2","3"," Четыре"]

array = ["Один", "Два", "Три"," Четыре"];
array.push("Пять");
//["Один", "Два", "Три", "Четыре", "Пять"]

array = ["Один", "Два"," Три"," Четыре"];
array.unshift("Ноль");
//["Ноль", "Один", "Два", "Три", "Четыре"]

array = ["Один", "Два"," Три"," Четыре"];
array.pop();
//["Один", "Два", "Три"] - Удаляет последний элемент массива и возвращает его.

array = ["Один", "Два"," Три"," Четыре"];
array.shift();
//["Два", "Три", "Четыре"] - удаляет первый элемент массива и возвращает его

array = ["Один", "Два", "Три"," Четыре"];
array.join("-");
//[Один-Два-Три-Четыре] - Преобразует массив в строку с разделением.

array = ["Один", "Два", "Три"," Четыре"];
array.sort();
//[Сортирует массив по алфавитному порядку, начиная с первой буквы массива]